Arthur2060/SAeD-ESP32/include/Motores.h
#ifndef MOTORES_H
#define MOTORES_H

#include "Bussola.h"

#include <Arduino.h>
#include <ESP32Encoder.h>
#include <vector>
#include <map>
#include <string>

namespace SAeD
{
    struct Motor
    {
        int PWM_PIN;
        int IN1_PIN;
        int IN2_PIN;

        int ENC_PIN_1;
        int ENC_PIN_2;
    };

    class Motores
    {
    private:
        Motor left, right;

        Bussola bussola;

        // Encoders
        ESP32Encoder encoderLeft;
        ESP32Encoder encoderRight;

        const int ONE_METER_DELAY = 4500;
        const int TOTAL_SPIN_DELAY = 8000;

        int currentSpeed = 100; // %

        void moveForward();
        void moveBackward();
        void turnLeft();
        void turnRight();
        void spin360();

        void moveDistance(bool front);
        void rotate(bool direction);
        void setMotorDirection(int in1, int in2, bool direction);
        void stopMotors();
        void correctOrientation();

    public:
        Motores();
        void setCellScale(float cellScale);
        void begin();
        bool lerComandos(std::vector<char> comandos);
        void setSpeed(int newSpeed);
    };
}

#endif
